IOsetting/py32f0-template/Misc/py32f003xx.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>RCC</name>
			<description>Reset and clock control</description>
			<groupName>RCC</groupName>
			<baseAddress>0x40021000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x400</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>RCC</name>
				<description>RCC global Interrupt</description>
				<value>4</value>
			</interrupt>
			<registers>
				<register>
					<name>CR</name>
					<displayName>CR</displayName>
					<description>Clock control register</description>
					<addressOffset>0x0</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000100</resetValue>
					<fields>
						<field>
							<name>CSSON</name>
							<description>Clock security system
							enable</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>HSEBYP</name>
							<description>HSE crystal oscillator
							bypass</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>HSERDY</name>
							<description>HSE clock ready flag</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>HSEON</name>
							<description>HSE clock enable</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>HSIDIV</name>
							<description>HSI16 clock division
							factor</description>
							<bitOffset>11</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
						<field>
							<name>HSIRDY</name>
							<description>HSI16 clock ready flag</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>HSIKERON</name>
							<description>HSI16 always enable for peripheral
							kernels</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>HSION</name>
							<description>HSI16 clock enable</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>ICSCR</name>
					<displayName>ICSCR</displayName>
					<description>Internal clock sources calibration
					register</description>
					<addressOffset>0x4</addressOffset>
					<size>0x20</size>
					<resetValue>0x10000000</resetValue>
					<fields>
						<field>
							<name>LSI_STARTUP</name>
							<description>LSI startup time </description>
							<bitOffset>26</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>LSI_TRIM</name>
							<description>LSI clock trimming</description>
							<bitOffset>16</bitOffset>
							<bitWidth>9</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>HSI_FS</name>
							<description>HSI frequency selection</description>
							<bitOffset>13</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>HSI_TRIM</name>
							<description>HSI clock trimming</description>
							<bitOffset>0</bitOffset>
							<bitWidth>13</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CFGR</name>
					<displayName>CFGR</displayName>
					<description>Clock configuration register</description>
					<addressOffset>0x8</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>MCOPRE</name>
							<description>Microcontroller clock output
							prescaler</description>
							<bitOffset>28</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MCOSEL</name>
							<description>Microcontroller clock
							output</description>
							<bitOffset>24</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PPRE</name>
							<description>APB prescaler</description>
							<bitOffset>12</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>HPRE</name>
							<description>AHB prescaler</description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SWS</name>
							<description>System clock switch status</description>
							<bitOffset>3</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>SW</name>
							<description>System clock switch</description>
							<bitOffset>0</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ECSCR</name>
					<displayName>ECSCR</displayName>
					<description>External clock source control register</description>
					<addressOffset>0x10</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>HSE_FREQ</name>
							<description>HSE clock freqency selection</description>
							<bitOffset>2</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CIER</name>
					<displayName>CIER</displayName>
					<description>Clock interrupt enable
					register</description>
					<addressOffset>0x18</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>HSERDYIE</name>
							<description>HSE ready interrupt enable</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>HSIRDYIE</name>
							<description>HSI ready interrupt enable</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>LSIRDYIE</name>
							<description>LSI ready interrupt enable</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>CIFR</name>
					<displayName>CIFR</displayName>
					<description>Clock interrupt flag register</description>
					<addressOffset>0x1C</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>CSSF</name>
							<description>HSE clock secure system interrupt flag</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>HSERDYF</name>
							<description>HSE ready interrupt flag</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>HSIRDYF</name>
							<description>HSI ready interrupt flag</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>LSIRDYF</name>
							<description>LSI ready interrupt flag</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>CICR</name>
					<displayName>CICR</displayName>
					<description>Clock interrupt clear register</description>
					<addressOffset>0x20</addressOffset>
					<size>0x20</size>
					<access>write-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>CSSC</name>
							<description>clock secure system interrupt flag clear</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>HSERDYC</name>
							<description>HSE ready interrupt clear</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>HSIRDYC</name>
							<description>HSI ready interrupt clear</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>LSIRDYC</name>
							<description>LSI ready interrupt clear</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>IOPRSTR</name>
					<displayName>IOPRSTR</displayName>
					<description>GPIO reset register</description>
					<addressOffset>0x24</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>GPIOFRST</name>
							<description>I/O port F reset</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>GPIOBRST</name>
							<description>I/O port B reset</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>GPIOARST</name>
							<description>I/O port A reset</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>AHBRSTR</name>
					<displayName>AHBRSTR</displayName>
					<description>AHB peripheral reset register</description>
					<addressOffset>0x28</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>CRCRST</name>
							<description>CRC reset</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DMARST</name>
							<description>DMA reset</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>APBRSTR1</name>
					<displayName>APBRSTR1</displayName>
					<description>APB peripheral reset register
					1</description>
					<addressOffset>0x2C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>LPTIMRST</name>
							<description>Low Power Timer reset</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PWRRST</name>
							<description>Power interface reset</description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DBGRST</name>
							<description>Debug support reset</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>I2CRST</name>
							<description>I2C reset</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>USART2RST</name>
							<description>USART2 reset</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TIM3RST</name>
							<description>TIM3 timer reset</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>APBRSTR2</name>
					<displayName>APBRSTR2</displayName>
					<description>APB peripheral reset register
					2</description>
					<addressOffset>0x30</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>COMP2RST</name>
							<description>COMP2 reset</description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>COMP1RST</name>
							<description>COMP1 reset</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ADCRST</name>
							<description>ADC reset</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TIM17RST</name>
							<description>TIM17 timer reset</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TIM16RST</name>
							<description>TIM16 timer reset</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TIM14RST</name>
							<description>TIM14 timer reset</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>USART1RST</name>
							<description>USART1 reset</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SPI1RST</name>
							<description>SPI1 reset</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TIM1RST</name>
							<description>TIM1 timer reset</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SYSCFGRST</name>
							<description>SYSCFG and COMP
							reset</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>IOPENR</name>
					<displayName>IOPENR</displayName>
					<description>GPIO clock enable register</description>
					<addressOffset>0x34</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>GPIOFEN</name>
							<description>I/O port F clock enable</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>GPIOBEN</name>
							<description>I/O port B clock enable</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>GPIOAEN</name>
							<description>I/O port A clock enable</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>AHBENR</name>
					<displayName>AHBENR</displayName>
					<description>AHB peripheral clock enable
					register</description>
					<addressOffset>0x38</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>CRCEN</name>
							<description>CRC clock enable</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SRAMEN</name>
							<description>SRAM memory interface clock
							enable</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>FLASHEN</name>
							<description>Flash memory interface clock
							enable</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DMAEN</name>
							<description>DMA clock enable</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>APBENR1</name>
					<displayName>APBENR1</displayName>
					<description>APB peripheral clock enable register
					1</description>
					<addressOffset>0x3C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>LPTIMEN</name>
							<description>LPTIM clock enable</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PWREN</name>
							<description>Power interface clock
							enable</description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DBGEN</name>
							<description>Debug support clock enable</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>I2CEN</name>
							<description>I2C clock enable</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>USART2EN</name>
							<description>USART2 clock enable</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>WWDGEN</name>
							<description>WWDG clock enable</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RTCAPBEN</name>
							<description>RTC APB clock enable</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TIM3EN</name>
							<description>TIM3 timer clock enable</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>APBENR2</name>
					<displayName>APBENR2</displayName>
					<description>APB peripheral clock enable register
					2</description>
					<addressOffset>0x40</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>COMP2EN</name>
							<description>COMP2 clock enable</description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>COMP1EN</name>
							<description>COMP1 clock enable</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ADCEN</name>
							<description>ADC clock enable</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TIM17EN</name>
							<description>TIM16 timer clock enable</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TIM16EN</name>
							<description>TIM16 timer clock enable</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TIM14EN</name>
							<description>TIM14 timer clock enable</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>USART1EN</name>
							<description>USART1 clock enable</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SPI1EN</name>
							<description>SPI1 clock enable</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TIM1EN</name>
							<description>TIM1 timer clock enable</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SYSCFGEN</name>
							<description>SYSCFG, COMP and VREFBUF clock
							enable</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>CCIPR</name>
					<displayName>CCIPR</displayName>
					<description>Peripherals independent clock configuration
					register</description>
					<addressOffset>0x54</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>LPTIM1SEL</name>
							<description>LPTIM1 clock source
							selection</description>
							<bitOffset>18</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>COMP2SEL</name>
							<description>COMP2 clock source
							selection</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>COMP1SEL</name>
							<description>COMP1 clock source
							selection</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PVDSEL</name>
							<description>PVD detect clock source
							selection</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>BDCR</name>
					<displayName>BDCR</displayName>
					<description>RTC domain control register</description>
					<addressOffset>0x5C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>LSCOSEL</name>
							<description>Low-speed clock output
							selection</description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>LSCOEN</name>
							<description>Low-speed clock output (LSCO)
							enable</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>BDRST</name>
							<description>RTC domain software reset</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RTCEN</name>
							<description>RTC clock source enable</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RTCSEL</name>
							<description>RTC clock source selection</description>
							<bitOffset>8</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
					</fields>
				</register>
