IOsetting/py32f0-template/Misc/py32f003xx.svd
					<register>
						<name>CCMR1_Input</name>
						<displayName>CCMR1_Input</displayName>
						<description>capture/compare mode register 1 (input
						mode)</description>
						<alternateRegister>CCMR1_Output</alternateRegister>
						<addressOffset>0x18</addressOffset>
						<size>0x20</size>
						<access>read-write</access>
						<resetValue>0x00000000</resetValue>
						<fields>
							<field>
								<name>IC2F</name>
								<description>Input capture 2 filter</description>
								<bitOffset>12</bitOffset>
								<bitWidth>4</bitWidth>
							</field>
							<field>
								<name>IC2PSC</name>
								<description>Input capture 2 prescaler</description>
								<bitOffset>10</bitOffset>
								<bitWidth>2</bitWidth>
							</field>
							<field>
								<name>CC2S</name>
								<description>Capture/Compare 2
								selection</description>
								<bitOffset>8</bitOffset>
								<bitWidth>2</bitWidth>
							</field>
							<field>
								<name>IC1F</name>
								<description>Input capture 1 filter</description>
								<bitOffset>4</bitOffset>
								<bitWidth>4</bitWidth>
							</field>
							<field>
								<name>ICPSC</name>
								<description>Input capture 1 prescaler</description>
								<bitOffset>2</bitOffset>
								<bitWidth>2</bitWidth>
							</field>
							<field>
								<name>CC1S</name>
								<description>Capture/Compare 1
								selection</description>
								<bitOffset>0</bitOffset>
								<bitWidth>2</bitWidth>
							</field>
						</fields>
					</register>
					<register>
						<name>CCMR2_Output</name>
						<displayName>CCMR2_Output</displayName>
						<description>capture/compare mode register (output
						mode)</description>
						<addressOffset>0x1C</addressOffset>
						<size>0x20</size>
						<access>read-write</access>
						<resetValue>0x00000000</resetValue>
						<fields>
							<field>
								<name>OC4CE</name>
								<description>Output compare 4 clear
								enable</description>
								<bitOffset>15</bitOffset>
								<bitWidth>1</bitWidth>
							</field>
							<field>
								<name>OC4M</name>
								<description>Output compare 4 mode</description>
								<bitOffset>12</bitOffset>
								<bitWidth>3</bitWidth>
							</field>
							<field>
								<name>OC4PE</name>
								<description>Output compare 4 preload
								enable</description>
								<bitOffset>11</bitOffset>
								<bitWidth>1</bitWidth>
							</field>
							<field>
								<name>OC4FE</name>
								<description>Output compare 4 fast
								enable</description>
								<bitOffset>10</bitOffset>
								<bitWidth>1</bitWidth>
							</field>
							<field>
								<name>CC4S</name>
								<description>Capture/Compare 4
								selection</description>
								<bitOffset>8</bitOffset>
								<bitWidth>2</bitWidth>
							</field>
							<field>
								<name>OC3CE</name>
								<description>Output compare 3 clear
								enable</description>
								<bitOffset>7</bitOffset>
								<bitWidth>1</bitWidth>
							</field>
							<field>
								<name>OC3M</name>
								<description>Output compare 3 mode</description>
								<bitOffset>4</bitOffset>
								<bitWidth>3</bitWidth>
							</field>
							<field>
								<name>OC3PE</name>
								<description>Output compare 3 preload
								enable</description>
								<bitOffset>3</bitOffset>
								<bitWidth>1</bitWidth>
							</field>
							<field>
								<name>OC3FE</name>
								<description>Output compare 3 fast
								enable</description>
								<bitOffset>2</bitOffset>
								<bitWidth>1</bitWidth>
							</field>
							<field>
								<name>CC3S</name>
								<description>Capture/Compare 3
								selection</description>
								<bitOffset>0</bitOffset>
								<bitWidth>2</bitWidth>
							</field>
						</fields>
					</register>
					<register>
						<name>CCMR2_Input</name>
						<displayName>CCMR2_Input</displayName>
						<description>capture/compare mode register 2 (input
						mode)</description>
						<alternateRegister>CCMR2_Output</alternateRegister>
						<addressOffset>0x1C</addressOffset>
						<size>0x20</size>
						<access>read-write</access>
						<resetValue>0x00000000</resetValue>
						<fields>
							<field>
								<name>IC4F</name>
								<description>Input capture 4 filter</description>
								<bitOffset>12</bitOffset>
								<bitWidth>4</bitWidth>
							</field>
							<field>
								<name>IC4PSC</name>
								<description>Input capture 4 prescaler</description>
								<bitOffset>10</bitOffset>
								<bitWidth>2</bitWidth>
							</field>
							<field>
								<name>CC4S</name>
								<description>Capture/Compare 4
								selection</description>
								<bitOffset>8</bitOffset>
								<bitWidth>2</bitWidth>
							</field>
							<field>
								<name>IC3F</name>
								<description>Input capture 3 filter</description>
								<bitOffset>4</bitOffset>
								<bitWidth>4</bitWidth>
							</field>
							<field>
								<name>IC3PSC</name>
								<description>Input capture 3 prescaler</description>
								<bitOffset>2</bitOffset>
								<bitWidth>2</bitWidth>
							</field>
							<field>
								<name>CC3S</name>
								<description>Capture/compare 3
								selection</description>
								<bitOffset>0</bitOffset>
								<bitWidth>2</bitWidth>
							</field>
						</fields>
					</register>
					<register>
						<name>CCER</name>
						<displayName>CCER</displayName>
						<description>capture/compare enable
						register</description>
						<addressOffset>0x20</addressOffset>
						<size>0x20</size>
						<access>read-write</access>
						<resetValue>0x0000</resetValue>
						<fields>
							<field>
								<name>CC4P</name>
								<description>Capture/Compare 3 output
								Polarity</description>
								<bitOffset>13</bitOffset>
								<bitWidth>1</bitWidth>
							</field>
							<field>
								<name>CC4E</name>
								<description>Capture/Compare 4 output
								enable</description>
								<bitOffset>12</bitOffset>
								<bitWidth>1</bitWidth>
							</field>
							<field>
								<name>CC3NP</name>
								<description>Capture/Compare 3 output
								Polarity</description>
								<bitOffset>11</bitOffset>
								<bitWidth>1</bitWidth>
							</field>
							<field>
								<name>CC3NE</name>
								<description>Capture/Compare 3 complementary output
								enable</description>
								<bitOffset>10</bitOffset>
								<bitWidth>1</bitWidth>
							</field>
							<field>
								<name>CC3P</name>
								<description>Capture/Compare 3 output
								Polarity</description>
								<bitOffset>9</bitOffset>
								<bitWidth>1</bitWidth>
							</field>
							<field>
								<name>CC3E</name>
								<description>Capture/Compare 3 output
								enable</description>
								<bitOffset>8</bitOffset>
								<bitWidth>1</bitWidth>
							</field>
							<field>
								<name>CC2NP</name>
								<description>Capture/Compare 2 output
								Polarity</description>
								<bitOffset>7</bitOffset>
								<bitWidth>1</bitWidth>
							</field>
							<field>
								<name>CC2NE</name>
								<description>Capture/Compare 2 complementary output
								enable</description>
								<bitOffset>6</bitOffset>
								<bitWidth>1</bitWidth>
							</field>
							<field>
								<name>CC2P</name>
								<description>Capture/Compare 2 output
								Polarity</description>
								<bitOffset>5</bitOffset>
								<bitWidth>1</bitWidth>
							</field>
							<field>
								<name>CC2E</name>
								<description>Capture/Compare 2 output
								enable</description>
								<bitOffset>4</bitOffset>
								<bitWidth>1</bitWidth>
							</field>
							<field>
								<name>CC1NP</name>
								<description>Capture/Compare 1 output
								Polarity</description>
								<bitOffset>3</bitOffset>
								<bitWidth>1</bitWidth>
							</field>
							<field>
								<name>CC1NE</name>
								<description>Capture/Compare 1 complementary output
								enable</description>
								<bitOffset>2</bitOffset>
								<bitWidth>1</bitWidth>
							</field>
							<field>
								<name>CC1P</name>
								<description>Capture/Compare 1 output
								Polarity</description>
								<bitOffset>1</bitOffset>
								<bitWidth>1</bitWidth>
							</field>
							<field>
								<name>CC1E</name>
								<description>Capture/Compare 1 output
								enable</description>
								<bitOffset>0</bitOffset>
								<bitWidth>1</bitWidth>
							</field>
						</fields>
					</register>
					<register>
						<name>CNT</name>
						<displayName>CNT</displayName>
						<description>counter</description>
						<addressOffset>0x24</addressOffset>
						<size>0x20</size>
						<access>read-write</access>
						<resetValue>0x00000000</resetValue>
						<fields>
							<field>
								<name>CNT</name>
								<description>counter value</description>
								<bitOffset>0</bitOffset>
								<bitWidth>16</bitWidth>
							</field>
						</fields>
					</register>
					<register>
						<name>PSC</name>
						<displayName>PSC</displayName>
						<description>prescaler</description>
						<addressOffset>0x28</addressOffset>
						<size>0x20</size>
						<access>read-write</access>
						<resetValue>0x0000</resetValue>
						<fields>
							<field>
								<name>PSC</name>
								<description>Prescaler value</description>
								<bitOffset>0</bitOffset>
								<bitWidth>16</bitWidth>
							</field>
						</fields>
					</register>
					<register>
						<name>ARR</name>
						<displayName>ARR</displayName>
						<description>auto-reload register</description>
						<addressOffset>0x2C</addressOffset>
						<size>0x20</size>
						<access>read-write</access>
						<resetValue>0x00000000</resetValue>
						<fields>
							<field>
								<name>ARR</name>
								<description>Auto-reload value</description>
								<bitOffset>0</bitOffset>
								<bitWidth>16</bitWidth>
							</field>
						</fields>
					</register>
					<register>
						<name>RCR</name>
						<displayName>RCR</displayName>
						<description>repetition counter register</description>
						<addressOffset>0x30</addressOffset>
						<size>0x20</size>
						<access>read-write</access>
						<resetValue>0x0000</resetValue>
						<fields>
							<field>
								<name>REP</name>
								<description>Repetition counter value</description>
								<bitOffset>0</bitOffset>
								<bitWidth>8</bitWidth>
							</field>
						</fields>
					</register>
					<register>
						<name>CCR1</name>
						<displayName>CCR1</displayName>
						<description>capture/compare register 1</description>
						<addressOffset>0x34</addressOffset>
						<size>0x20</size>
						<access>read-write</access>
						<resetValue>0x00000000</resetValue>
						<fields>
							<field>
								<name>CCR1</name>
								<description>Capture/Compare 1 value</description>
								<bitOffset>0</bitOffset>
								<bitWidth>16</bitWidth>
							</field>
						</fields>
					</register>
					<register>
						<name>CCR2</name>
						<displayName>CCR2</displayName>
						<description>capture/compare register 2</description>
						<addressOffset>0x38</addressOffset>
						<size>0x20</size>
						<access>read-write</access>
						<resetValue>0x00000000</resetValue>
						<fields>
							<field>
								<name>CCR2</name>
								<description>Capture/Compare 2 value</description>
								<bitOffset>0</bitOffset>
								<bitWidth>16</bitWidth>
							</field>
						</fields>
					</register>
					<register>
						<name>CCR3</name>
						<displayName>CCR3</displayName>
						<description>capture/compare register 3</description>
						<addressOffset>0x3C</addressOffset>
						<size>0x20</size>
						<access>read-write</access>
						<resetValue>0x00000000</resetValue>
						<fields>
							<field>
								<name>CCR3</name>
								<description>Capture/Compare value</description>
								<bitOffset>0</bitOffset>
								<bitWidth>16</bitWidth>
							</field>
						</fields>
					</register>
					<register>
						<name>CCR4</name>
						<displayName>CCR4</displayName>
						<description>capture/compare register 4</description>
						<addressOffset>0x40</addressOffset>
						<size>0x20</size>
						<access>read-write</access>
						<resetValue>0x00000000</resetValue>
						<fields>
							<field>
								<name>CCR4</name>
								<description>Capture/Compare value</description>
								<bitOffset>0</bitOffset>
								<bitWidth>16</bitWidth>
							</field>
						</fields>
					</register>
					<register>
						<name>BDTR</name>
						<displayName>BDTR</displayName>
						<description>break and dead-time register</description>
						<addressOffset>0x44</addressOffset>
						<size>0x20</size>
						<access>read-write</access>
						<resetValue>0x0000</resetValue>
						<fields>
							<field>
								<name>MOE</name>
								<description>Main output enable</description>
								<bitOffset>15</bitOffset>
								<bitWidth>1</bitWidth>
							</field>
							<field>
								<name>AOE</name>
								<description>Automatic output enable</description>
								<bitOffset>14</bitOffset>
								<bitWidth>1</bitWidth>
							</field>
							<field>
								<name>BKP</name>
								<description>Break polarity</description>
								<bitOffset>13</bitOffset>
								<bitWidth>1</bitWidth>
							</field>
							<field>
								<name>BKE</name>
								<description>Break enable</description>
								<bitOffset>12</bitOffset>
								<bitWidth>1</bitWidth>
							</field>
							<field>
								<name>OSSR</name>
								<description>Off-state selection for Run
								mode</description>
								<bitOffset>11</bitOffset>
								<bitWidth>1</bitWidth>
							</field>
							<field>
								<name>OSSI</name>
								<description>Off-state selection for Idle
								mode</description>
								<bitOffset>10</bitOffset>
								<bitWidth>1</bitWidth>
							</field>
							<field>
								<name>LOCK</name>
								<description>Lock configuration</description>
								<bitOffset>8</bitOffset>
								<bitWidth>2</bitWidth>
							</field>
							<field>
								<name>DTG</name>
								<description>Dead-time generator setup</description>
								<bitOffset>0</bitOffset>
								<bitWidth>8</bitWidth>
							</field>
						</fields>
					</register>
					<register>
						<name>DCR</name>
						<displayName>DCR</displayName>
						<description>DMA control register</description>
						<addressOffset>0x48</addressOffset>
						<size>0x20</size>
						<access>read-write</access>
						<resetValue>0x0000</resetValue>
						<fields>
							<field>
								<name>DBL</name>
								<description>DMA burst length</description>
								<bitOffset>8</bitOffset>
								<bitWidth>5</bitWidth>
							</field>
							<field>
								<name>DBA</name>
								<description>DMA base address</description>
								<bitOffset>0</bitOffset>
								<bitWidth>5</bitWidth>
							</field>
						</fields>
					</register>
					<register>
						<name>DMAR</name>
						<displayName>DMAR</displayName>
						<description>DMA address for full transfer</description>
						<addressOffset>0x4C</addressOffset>
						<size>0x20</size>
						<access>read-write</access>
						<resetValue>0x0000</resetValue>
						<fields>
							<field>
								<name>DMAB</name>
								<description>DMA register for burst
								accesses</description>
								<bitOffset>0</bitOffset>
								<bitWidth>16</bitWidth>
							</field>
						</fields>
					</register>
